{
  "anecdotes": [
    {
      "content": "If it hurts, do it more often",
      "id": "47145",
      "votes": 3
    },
    {
      "content": "Adding manpower to a late software project makes it later!",
      "id": "21149",
      "votes": 1
    },
    {
      "content": "The first 90 percent of the code accounts for the first 90 percent of the development time...The remaining 10 percent of the code accounts for the other 90 percent of the development time.",
      "id": "69581",
      "votes": 1
    },
    {
      "content": "Any fool can write code that a computer can understand. Good programmers write code that humans can understand.",
      "id": "36975",
      "votes": 0
    },
    {
      "content": "Premature optimization is the root of all evil.",
      "id": "25170",
      "votes": 0
    },
    {
      "content": "Debugging is twice as hard as writing the code in the first place. Therefore, if you write the code as cleverly as possible, you are, by definition, not smart enough to debug it.",
      "id": "98312",
      "votes": 0
    },
    {
      "content": "coding is my life",
      "id": "77596",
      "votes": 0
    },
    {
      "content": "One of the best programming skills you can have is knowing when to walk away for awhile.",
      "id": "37901",
      "votes": 0
    },
    {
      "content": "Bad programmers worry about the code. Good programmers worry about data structures and their relationships.",
      "id": "48887",
      "votes": 0
    },
    {
      "content": "Bad programmers worry about the code. Good programmers worry about data structures and their relationships.",
      "id": "44756",
      "votes": 1
    },
    {
      "content": "No one in the brief history of computing has ever written a piece of perfect software. It’s unlikely that you’ll be the first.",
      "id": "60875",
      "votes": 0
    },
    {
      "content": "Give someone a program; you frustrate them for a day; teach them how to program, and you frustrate them for a lifetime.",
      "id": "93983",
      "votes": 0
    },
    {
      "content": "coding is my life",
      "id": "16256",
      "votes": 0
    }
  ]
}